---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCannotApplyDivideSettings
source: html/583f6984-6695-4b04-7c40-c15abb91efcb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCannotApplyDivideSettings Property

Default Divide settings were not applied to Divided Surface. Please adjust grid spacing values manually.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCannotApplyDivideSettings { get; }
```